import Employee from './employee.js';

const names = ["Косар", "Ткаченко", "Гурик", "Ключковський", "Зеров", "Грабінський", "Тимощук", "Семків", "Громики", "Чарниш", "Богаченко", "Якутович", "Гнідичі", "Вертипорох", "Дорошкевич", "Семкович", "Піснячевський", "Малий", "Бобикевич", "Садовий", "Сиченко", "Рудинський", "Анищенко", "Чаплинський", "Пашко", "Худченко", "Бевзенко", "Шпек", "Костриця", "Панко", "Паращук", "Волощак", "Проць", "Климович", "Чаговець", "Холоденко", "Шумлянський", "Конончук", "Томашевський", "Чорногуз", "Тригуб", "Грицьків", "Бурч", "Федюк", "Тимчак", "Бокшай", "Могитич", "Черкасенко", "Березовченко", "Радкевич", "Якобовський", "Індишевський", "Гомоляка", "Залізняк", "Ющук", "Бурлюк", "Лончина", "Трутовський", "Гречаний", "Дідушицький", "Ковбасюк", "Федечко", "Майданюк", "Підлужний", "Ярмоленко", "Шестак", "Мохнацький", "Беринда", "Олешко", "Загул", "Карпінський", "Недря", "Лагода", "Мартинович", "Микитин", "Снігур", "Луняк", "Гірняк", "Таран", "Юрчук", "Франко", "Шиманський", "Колесників", "Шахрай", "Старовойт", "Чех", "Кохановський", "Шищенко", "Смик", "Солдатенко", "Стадницький", "Крохмаль", "Баланчук", "Лось", "Богун", "Бурлака", "Апостол", "Воєвода",];
const fullName = ["В.М.", "Ш.Г.", "Т.С.", "О.М.", "Н.Я.", "Ю.О.", "О.М.", "П.Д.", "Н.З.", "Р.С.", "В.Н.", "Я.Й.", "В.Б.", "Л.Й.", "І.В.", "Б.Ж.", "Ф.А.", "Т.Ю.", "В.Ю.", "Й.Р.", "Д.Я.", "С.А.", "Ц.О.", "О.Г.", "О.Я.", "Щ.О.", "Ю.Б.", "І.Т.", "П.Я.", "Ф.Ч.", "П.І.", "В.О.", "І.Г.", "С.Я.", "Й.А.", "К.М.", "Х.Б.", "Я.Б.", "Р.Р.", "В.Ч.", "Р.Г.", "Л.П.", "Ш.К.", "С.С.", "Л.Г.", "Б.Т.", "Ю.Г.", "П.Г.", "Д.З.", "Й.О.", "Г.А.", "Х.В.", "О.Г.", "Т.Н.", "Н.З.", "Е.Я.", "З.Б.", "Ж.П.", "Б.М.", "А.В.", "Т.Д.", "К.Ю.", "У.П.", "А.В.", "О.А.", "Х.Ч.", "В.Ю.", "Ф.Ю.", "Ч.Т.", "У.Б.", "Ю.З.", "Є.І.", "Т.Н.", "В.Д.", "Щ.Ф.", "Ч.Б.", "П.П.", "М.Т.", "Й.Г.", "Л.Л.", "У.М.", "Г.Н.", "К.Ж.", "Г.Б.", "С.Л.", "Є.І.", "Ж.С.", "Т.Г.", "Й.Д.", "А.С.", "Б.Я.", "Щ.А.", "Б.С.", "Й.Г.", "Є.М.", "З.Г.", "К.Г.", "Й.З.", "У.А."];
const professions = ["Сварщик", "Слюсар", "Фрезерувальник", "Столяр", "Водій", "Завідувач складу"];

function getNumber(min, max) {
    return parseInt(Math.random() * (max - min) + min);
}

const generatePersonalList = (amountPersonal) => {
    let personalList = [];
    for (let i = 0; i < amountPersonal; ++i) {
        personalList[i] = new Employee(
            Date.now(),
            `${names[getNumber(0, names.length)]} ${fullName[getNumber(0, names.length)]}`,
            getNumber(1, 10),
            professions[getNumber(0, professions.length)],
            getNumber(1, 10),
            getNumber(1, 30)
        );
    }
    return personalList;
}

export { generatePersonalList };